iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_tc_driver.c
/***********************************************************************
 * ID: lpc23xx_tc_driver.c 2008-11-03 HieuNguyen
 *
 * Project: LPC23xx timer driver
 *
 * Description:
 *     This file contains driver support for the LPC23xx timer.
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only  
 * which provides customers with programming information regarding the  
 * products. This software is supplied "AS IS" without any warranties.  
 * NXP Semiconductors assumes no responsibility or liability for the 
 * use of the software, conveys no license or title under any patent, 
 * copyright, or mask work right to the product. NXP Semiconductors 
 * reserves the right to make changes in the software without 
 * notification. NXP Semiconductors also make no representation or 
 * warranty that such application will be suitable for the specified 
 * use without further testing or modification. 
 *********************************************************************/
#include "lpc23xx_tc_driver.h"
#include "lpc23xx_scb_driver.h"


/***********************************************************************
 * Timer driver package data
***********************************************************************/

/* Timer device configuration structure type */
typedef struct
{
	BOOL32 			init;		/* Init flag of timer/counter device */
	TC_Type 		*regptr; 	/* Pointer to timer register */
} TC_DAT_Type;

/* Timer /counter driver data */
static TC_DAT_Type tcdat[4] = {
		{FALSE, (TC_Type *) 0}, 
		{FALSE, (TC_Type *) 0}, 
		{FALSE, (TC_Type *) 0}, 
		{FALSE, (TC_Type *) 0},
};


/***********************************************************************
 * Timer driver private functions
 **********************************************************************/
U32 timer_get_pclock (S32 timernum);
U32 timer_usec_to_val (S32 timernum, U32 usec);
S32 timer_ptr_to_timer_num (TC_Type *pTimer);
S32 timer_cfg_to_timer_num (TC_DAT_Type *pTimerCfg);
void timer_delay_cmn(TC_Type *pTimer, U32 usec);


/***********************************************************************
 * Function: timer_get_pclock
 * Purpose: Get peripheral clock of each timer controller
 * Parameters:
 *     timernum: Timer number
 * Returns: Peripheral clock of timer
 **********************************************************************/
U32 timer_get_pclock (S32 timernum)
{
	U32 clkdlycnt;
	switch (timernum)
	{
	case 0:
		clkdlycnt = (U64)SCB_GetPCLK (PCLK_TIMER0);
		break;
		
	case 1:
		clkdlycnt = (U64)SCB_GetPCLK (PCLK_TIMER1);
		break;
		
	case 2:
		clkdlycnt = (U64)SCB_GetPCLK (PCLK_TIMER2);
		break;
		
	case 3:
		clkdlycnt = (U64)SCB_GetPCLK (PCLK_TIMER3);
		break;
	}
	return clkdlycnt;
}


/***********************************************************************
 * Function: timer_usec_to_val
 * Purpose: Convert a time to a timer count value
 * Parameters:
 *     timernum: Timer number
 *     usec: Time in microseconds
 * Returns: The number of required clock ticks to give the time delay
 **********************************************************************/
U32 timer_usec_to_val (S32 timernum, U32 usec)
{
	U64 clkdlycnt;
	
	// Get Pclock of timer
	clkdlycnt = (U64) timer_get_pclock (timernum);
	clkdlycnt = (clkdlycnt * (U64) usec) / 1000000;

	return (U32) clkdlycnt;
}


/***********************************************************************
 * Function: timer_ptr_to_timer_num
 * Purpose: Convert a timer register pointer to a timer number
 * Parameters:
 *     pTimer: Pointer to a timer register set
 * Returns: The timer number (0 to 3) or -1 if register pointer is bad
 **********************************************************************/
S32 timer_ptr_to_timer_num (TC_Type *pTimer) 
{
	S32 tnum = -1;

	if (pTimer == TC0) 
	{
		tnum = 0;
	}
	else if (pTimer == TC1) 
	{
		tnum = 1;
	}
	else if (pTimer == TC2)
	{
		tnum = 2;
	}
	else if (pTimer == TC3)
	{
		tnum = 3;
	}
	
	return tnum;
}


/***********************************************************************
 * Function: timer_cfg_to_timer_num
 * Purpose: Convert a timer driver config pointer to a timer number
 * Parameters:
 *     pTimer: Pointer to a timer config structure
 * Returns: The timer number (0 to 3) or -1 if pointer is bad
 **********************************************************************/
S32 timer_cfg_to_timer_num (TC_DAT_Type *pTimerCfg)
{
	S32 tnum = -1;

	if (pTimerCfg == (TC_DAT_Type *) &tcdat[0])
	{
		tnum = 0;
	}
	else if (pTimerCfg == (TC_DAT_Type *) &tcdat[1])
	{
		tnum = 1;
	}
	else if (pTimerCfg == (TC_DAT_Type *) &tcdat[2])
	{
		tnum = 2;
	}
	else if (pTimerCfg == (TC_DAT_Type *) &tcdat[3])
	{
		tnum = 3;
	}
	
	return tnum;
}


/***********************************************************************
 * Function: timer_delay_cmn
 * Purpose: Delay for a period of microseconds
 * Parameters:
 *     pTimer: Pointer to timer register set to use
 *     usec  :  the delay time in microseconds
 * Returns: None
 **********************************************************************/
void timer_delay_cmn(TC_Type *pTimer, U32 usec)
{
    S32 timernum = -1;

	/* Get clock number */
	timernum = timer_ptr_to_timer_num(pTimer);
	
	if (timernum < 0)
	{
		return;
	}
	
	/* Reset and stop timer */
	pTimer->TCR = TC_RESET;
	pTimer->CTCR = 0x00;

    /* Clear and enable match function */
    pTimer->IR = 0xFFFFFFFF;

    timernum = timer_ptr_to_timer_num (pTimer);
    
    pTimer->PR = (U32) timer_usec_to_val(timernum, 1);
    
    /* Set match for number of usecs */
	pTimer->MR[0] = usec;

    /* Interrupt on match 0 */
	pTimer->MCR = TC_INT_ON_MATCH(0);

	/* Enable the timer */
	pTimer->TCR = TC_ENABLE;

	/* Loop until match occurs */
	while ((pTimer->IR & TC_MATCH_INT(0)) == 0);

