iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_tc_driver.c
	/* Stop timer */
	pTimer->TCR = 0;
}


/***********************************************************************
 * Timer driver public functions
 **********************************************************************/

/***********************************************************************
 * Function: TC_Init
 * Purpose: Init Timer/Counter device
 * Parameters:
 *     TCNum: timer number (0..3)
 * Returns:
	Pointer to timer device if success or 0 if error
 **********************************************************************/
S32 TC_Init (S32 TCNum)
{
	TC_DAT_Type *pTimerDat;
	U8 temp;
	
	if (TCNum >= 0 && TCNum <= 3)
	{
		pTimerDat = (TC_DAT_Type *) &tcdat[TCNum];
	}
	else
	{
		return 0;
	}

	/* Has the timer been previously initialized? */
	if (pTimerDat->init == FALSE) 
	{
		// Set init flag
		pTimerDat->init = TRUE;
		
		/* Save timer register pointer 
		 * Setup clock and power for timer controller
		 * peripheral clock devider set to 4 from CCLK as default */
		switch (TCNum)
		{
		case 0:
			pTimerDat->regptr = TC0;
			SCB_EnablePPWR (PCTIM0);
			SCB_SetPCLKDiv (PCLK_TIMER0, CCLK_DIV_4);
			break;
			
		case 1:
			pTimerDat->regptr = TC1;
			SCB_EnablePPWR (PCTIM1);
			SCB_SetPCLKDiv (PCLK_TIMER1, CCLK_DIV_4);
			break;
			
		case 2:
			pTimerDat->regptr = TC2;
			SCB_EnablePPWR (PCTIM2);
			SCB_SetPCLKDiv (PCLK_TIMER2, CCLK_DIV_4);
			break;
			
		case 3:
			pTimerDat->regptr = TC3;
			SCB_EnablePPWR (PCTIM3);
			SCB_SetPCLKDiv (PCLK_TIMER3, CCLK_DIV_4);
			break;
		}

		/* Setup default timer state as standard timer mode, timer
		   disabled and all match and counters disabled */
		pTimerDat->regptr->TCR = 0;
		pTimerDat->regptr->CTCR = 0;
		pTimerDat->regptr->MCR = 0;
		pTimerDat->regptr->CCR = 0;
		pTimerDat->regptr->EMR = 0;

		/* Clear pending interrupts and reset counts */
		pTimerDat->regptr->TC = 0;
		pTimerDat->regptr->PR = 0;
		pTimerDat->regptr->PC = 0;
		
		// Clear match register
		for (temp = 0; temp < 4; temp++)
		{
			pTimerDat->regptr->MR [temp] = 0;
		}
		
		// Clear interrupt pending
		pTimerDat->regptr->IR = 0xFFFFFFFF;
	}

	return (S32) pTimerDat;
}


/***********************************************************************
 * Function: TC_Close
 * Purpose: Close Timer/Counter device
 * Parameters:
 *     TCdev: Pointer to timer device
 * Returns: status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_Close (S32 TCdev)
{
	S32 tnum;
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	// Reset init flag 
	pTimerDat->init = FALSE;
	
	// Turn off power and clock
	tnum = timer_cfg_to_timer_num (pTimerDat);
	
	// Disable timer/counter
	pTimerDat->regptr->TCR = 0x00;
	
	switch (tnum)
	{
	case 0:
		SCB_DisablePPWR (PCTIM0);
		break;
	case 1:
		SCB_DisablePPWR (PCTIM1);
		break;
	case 2:
		SCB_DisablePPWR (PCTIM2);
		break;
	case 3:
		SCB_DisablePPWR (PCTIM3);
		break;	
	}
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_Start
 * Purpose: Start Timer/Counter device
 * Parameters:
 *     TCdev: Pointer to timer device
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_Start (S32 TCdev)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->TCR	|= TC_ENABLE;
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_Stop
 * Purpose: Stop Timer/Counter device 
 * Parameters:
 *     TCdev: Pointer to timer device
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_Stop (S32 TCdev)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->TCR &= ~TC_ENABLE;
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_Reset
 * Purpose: Reset count value in Timer/Counter device
 * Parameters:
 *     TCdev: Pointer to timer device
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_Reset (S32 TCdev)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->TCR |= TC_RESET;
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_SetMode
 * Purpose: Set operation mode for Timer/Counter device
 * Parameters:
 *     	TCdev: Pointer to timer device
 * 		TCMode: Timer/counter mode
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_SetMode (S32 TCdev, S32 TCMode)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	switch ((TC_MODE_OPT) TCMode)
	{
	case TC_TIMER_MODE:
		pTimerDat->regptr->CTCR = 0x00;
		break;
		
	case TC_COUNTER_RISING_MODE:
		pTimerDat->regptr->CTCR = 0x01;
		break;
		
	case TC_COUNTER_FALLING_MODE:
		pTimerDat->regptr->CTCR = 0x02;
		break;
	case TC_COUNTER_ANY_MODE:
		pTimerDat->regptr->CTCR = 0x03;
		break;
	}
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_SetupTimer
 * Purpose: Setup Timer for Timer/Counter device
 * Parameters:
 *     	TCdev: Pointer to timer device
 * 		prescale_option: prescale option (tick value or microsecond value)
 * 		prescale: prescale value
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_SetupTimer (S32 TCdev, S32 prescale_option, U32 prescale)
{
	S32 tnum = -1;
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	switch ((TC_PRESCALE_OPT) prescale_option)
	{
	case TC_PRESCALE_TICKVAL:
		pTimerDat->regptr->PR = prescale - 1;
		break;
		
	case TC_PRESCALE_USVAL:
		tnum = timer_cfg_to_timer_num (pTimerDat);
		pTimerDat->regptr->PR = (timer_usec_to_val(tnum, prescale)) - 1;
		break;	
	}
	
