iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_tc_driver.c
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_SetCounterInput
 * Purpose: Set Counter input source for Timer/Counter device
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		ICAPsource: capture input source for counter   
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_SetCounterInput (S32 TCdev, S32 ICAPsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->CTCR &= ~TC_CTCR_INPUT_MASK;
		
	switch ((TC_COUNTER_INPUT_OPT) ICAPsource)
	{
	case TC_COUNTER_INCAP0:
		// Do nothing
		break;
		
	case TC_COUNTER_INCAP1:
		pTimerDat->regptr->CTCR |= _BIT(2);
		break;
	}
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_ConfigExtMatch
 * Purpose: Configure External Match Output
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number 
 * 		ExtMatchtype: External output match type
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_ConfigExtMatch (S32 TCdev, U32 matchsource, S32 ExtMatchtype)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3) 
	{
		return _ERROR;
	}
	
	// Clear external match bit field
	pTimerDat->regptr->EMR &= ~TC_EM_MASK(matchsource);
	
	switch ((TC_EXTMATCH_OPT) ExtMatchtype)
	{
	case TC_EXTMATCH_NOTHING:
		// Do nothing
		break;
		
	case TC_EXTMATCH_LOW:
		pTimerDat->regptr->EMR |= TC_EM_SET(matchsource, TC_EM_LOW);
		break;
		
	case TC_EXTMATCH_HIGH:
		pTimerDat->regptr->EMR |= TC_EM_SET(matchsource, TC_EM_HIGH);
		break;
		
	case TC_EXTMATCH_TOGGLE:
		pTimerDat->regptr->EMR |= TC_EM_SET(matchsource, TC_EM_TOGGLE);
		break;
	}
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_SetMatch
 * Purpose: Setup match value for each match channel 
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number      
 * 		matchvalue: match value to set
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_SetMatch (S32 TCdev, U32 matchsource, U32 matchvalue)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3)
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->MR[matchsource] = matchvalue;
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_EnableMatchInt
 * Purpose: Enable Timer/Counter match interrupt
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number      
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_EnableMatchInt (S32 TCdev, U32 matchsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->MCR |= TC_INT_ON_MATCH(matchsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_DisableMatchInt
 * Purpose: Disable Timer/Counter match interrupt 
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number  
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_DisableMatchInt (S32 TCdev, U32 matchsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->MCR &= ~TC_INT_ON_MATCH(matchsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_EnableMatchResetTC
 * Purpose: Enable Reset Timer/Counter when matching
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number  
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_EnableMatchReset (S32 TCdev, U32 matchsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->MCR |= TC_RESET_ON_MATCH(matchsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_DisableMatchResetTC
 * Purpose: Disable Reset Timer/Counter when matching 
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number   
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_DisableMatchReset (S32 TCdev, U32 matchsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->MCR &= ~TC_RESET_ON_MATCH(matchsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_EnableMatchStopTC
 * Purpose: Enable Stop Timer/Counter when matching
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number   
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_EnableMatchStop (S32 TCdev, U32 matchsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3) 
	{
		return _ERROR;
	}
	
