iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_tc_driver.c
	pTimerDat->regptr->MCR |= TC_STOP_ON_MATCH(matchsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_DisableMatchStopTC
 * Purpose: Disable Stop Timer/Counter when matching
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number 
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_DisableMatchStop (S32 TCdev, U32 matchsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->MCR &= ~TC_STOP_ON_MATCH(matchsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_ReadIntPending
 * Purpose: Read Pending Match Interrupt in Timer/Counter device
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * Returns: Value of timer/counter interrupt register
 **********************************************************************/
U32 TC_ReadIntPending (S32 TCdev)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return 0;
	}
	
	return pTimerDat->regptr->IR;
}


/***********************************************************************
 * Function: TC_ClrMatchIntPending
 * Purpose: Clear pending Timer/Counter match interrupt flag
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		matchsource: match source number 
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_ClrMatchIntPending (S32 TCdev, U32 matchsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (matchsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->IR |= TC_MATCH_INT(matchsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_EnableCapInt
 * Purpose: Enable Timer/Counter capture interrupt
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		capsource: capture source number 
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_EnableCapInt (S32 TCdev, U32 capsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (capsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->CCR |= TC_INT_ON_CAP(capsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_DisableCapInt
 * Purpose: Disable Timer/Counter capture interrupt
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		capsource: capture source number
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_DisableCapInt (S32 TCdev, U32 capsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (capsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->CCR &= ~TC_INT_ON_CAP(capsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_ConfigCapture
 * Purpose: Configure capture mode for each capture source 
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		capsource: capture source number
 * 		capmode: capture mode  
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_ConfigCapture (S32 TCdev, U32 capsource, S32 capmode)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (capsource > 3)
	{
		return _ERROR;
	}
	
	// Clear bitfield of capture mode for each capture source 
	pTimerDat->regptr->CCR &= ~TC_EDGE_MASK(capsource);
	
	switch ((TC_CAP_MODE_OPT) capmode)
	{
	case TC_CAPTURE_NONE:
		// Do nothing
		break;
		
	case TC_CAPTURE_RISING:
		pTimerDat->regptr->CCR |= TC_CAP_RISING(capsource);
		break;
		
	case TC_CAPTURE_FALLING:
		pTimerDat->regptr->CCR |= TC_CAP_FALLING(capsource);
		break;
		
	case TC_CAPTURE_ANY:
		pTimerDat->regptr->CCR |= ((TC_CAP_RISING(capsource)) | (TC_CAP_FALLING(capsource)));
		break;
	}
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_ClrCapIntPending
 * Purpose: Clear pending Timer/Counter capture interrupt flag
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		capsource: capture source number
 * Returns: Status of progress (_ERROR or _NO_ERROR)
 **********************************************************************/
S32 TC_ClrCapIntPending (S32 TCdev, U32 capsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return _ERROR;
	}
	
	if (capsource > 3) 
	{
		return _ERROR;
	}
	
	pTimerDat->regptr->IR |= TC_CAP_INT(capsource);
	
	return _NO_ERROR;
}


/***********************************************************************
 * Function: TC_ReadCapture
 * Purpose: Read value of capture register in timer/counter device
 * Parameters:
 *     	TCdev: Pointer to timer/counter device
 * 		capsource: capture source number
 * Returns: Value of capture register
 **********************************************************************/
U32 TC_ReadCapture (S32 TCdev, U32 capsource)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return 0;
	}
	
	if (capsource > 3)
	{
		return 0;
	}
	
	return pTimerDat->regptr->CR[capsource];
}


/***********************************************************************
 * Function: TC_Waitms
 * Purpose: Delay for msec milliseconds (minimum)
 * Parameters:
 *     TCdev: Pointer to timer device
 *     msec  :  the delay time in milliseconds
 * Returns: Nothing
 **********************************************************************/
void TC_Waitms (S32 TCdev, U32 msec)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return;
	}
	
    timer_delay_cmn (pTimerDat->regptr, (msec * 1000));
}


/***********************************************************************
 * Function: TC_Waitus
 * Purpose: Delay for usec microseconds (minimum)
 * Parameters:
 *     TCdev: Pointer to timer device
 *     usec  :  the delay time in microseconds
 * Returns: Nothing
 **********************************************************************/
void TC_Waitus (S32 TCdev, U32 usec)
{
	TC_DAT_Type *pTimerDat = (TC_DAT_Type *) TCdev;
	
	if (pTimerDat->init == FALSE)
	{
		return;
	}
	
	timer_delay_cmn (pTimerDat->regptr, usec);
}

